<a href="https://colab.research.google.com/github/Riturajkumari/skills_basic_python/blob/main/Pandas_Assignement_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Consider following code to answer further questions:

import pandas as pd

course_name = [‘Data Science’, ‘Machine Learning’, ‘Big Data’, ‘Data Engineer’]

duration =  [2,3,6,4]

df = pd.DataFrame(data = {‘course_name’ : course_name, ‘duration’ : duration})

**Q1. Write a code to print the data present in the second row of the dataframe, df.?**

In [ ]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration =  [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration': duration})

In [ ]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [ ]:
df[['course_name','duration']][1:2]

        course_name  duration
1  Machine Learning         3

**Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?**

In [ ]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [ ]:
df.loc[:3]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [ ]:
df.iloc[:3]

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [ ]:
df.loc[1:3]

        course_name  duration
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [ ]:
df.iloc[1:3]

        course_name  duration
1  Machine Learning         3
2          Big Data         6

**Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df 
then find the output for both new_df.loc[2] and new_df.iloc[2]?**

In [ ]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [ ]:
print('\n\nDataframe after reindexing rows: \n',)
new_df=df.reindex([3,0,1,2])
new_df

Dataframe after reindexing rows:

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [ ]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [ ]:
 new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Did you observe any difference in both the outputs? If so then explain it.

Consider the below code to answer further questions

import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

#Creating a dataframe:

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [ ]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

In [ ]:
#Creating a dataframe:

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [ ]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.725587  0.218221  0.445338  0.114329  0.424059  0.284077
2  0.830040  0.187906  0.257979  0.821000  0.033920  0.963729
3  0.970780  0.931232  0.969063  0.703856  0.656398  0.309987
4  0.072348  0.180109  0.738443  0.619448  0.021055  0.431215
5  0.864323  0.190264  0.170099  0.699237  0.243526  0.801485
6  0.462421  0.704272  0.603944  0.731903  0.579536  0.135599

- In Python, random numbers  provides a random module in order to generate random numbers explicitly. random module in Python is used to create random numbers.

- Syntax : random.random()
Returns : This method returns a random floating number between 0 and 1.

Q4. Write a code to find the following statistical measurements for the above dataframe df1:

(i) mean of each and every column present in the dataframe.

(ii) standard deviation of column, 'column_2'

In [ ]:
# (i) mean of each and every column present in the dataframe.
df1.mean()

column_1    0.654250
column_2    0.402001
column_3    0.530811
column_4    0.614962
column_5    0.326416
column_6    0.487682
dtype: float64

In [ ]:
#(ii) standard deviation of column, 'column_2'
df1['column_2'].std()

0.33019172934873287

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the 
mean of column, column_2.

If you are getting errors in executing it then explain why.

[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [ ]:
df1['column_2'].mean()

0.4020008157435753

Q6. What do you understand about the windows function in pandas and list the types of windows 
functions?

**Windowing operations currently only support numeric data (integer and float) and will always return float64 values.**

pandas supports 4 types of windowing operations:
- Rolling window: Generic fixed or variable sliding window over the values.

- Weighted window: Weighted, non-rectangular window supplied by the scipy.signal library.

- Expanding window: Accumulating window over the values.

- Exponentially Weighted window: Accumulating and exponentially weighted window over the values.

In [ ]:
s = pd.Series([np.nan, 1, 2, np.nan, np.nan, 3])
s.rolling(window=3, min_periods=1).sum()

0    NaN
1    1.0
2    3.0
3    3.0
4    2.0
5    3.0
dtype: float64

Q7. Write a code to print only the current month and year at the time of answering this question.

[Hint: Use pandas.datetime function]

In [ ]:
# importing date class from datetime module
from datetime import date

# creating the date object of today's date
todays_date = date.today()

# printing todays date
print("Current date: ", todays_date)

# fetching the current year, month and day of today
print("Current year:", todays_date.year)
print("Current month:", todays_date.month)
print("Current day:", todays_date.day)

Current date:  2023-03-04
Current year: 2023
Current month: 3
Current day: 4

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and 
calculates the difference between them in days, hours, and minutes using Pandas time delta. The 
program should prompt the user to enter the dates and display the result?

In [ ]:
# import the datetime module
import datetime

# datetime in string format
input = '2023/03/04'

# format
format = '%Y/%m/%d'

# convert from string format to datetime format
datetime = datetime.datetime.strptime(input, format)

# get the date from the datetime using date()
# function
print(datetime.date())

2023-03-04

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified 
column to a categorical data type. The program should prompt the user to enter the file path, column 
name, and category order, and then display the sorted data?

In [ ]:
df= pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.dtypes=='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [ ]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
# Sorting by column 'Country'
df=df.sort_values(by=['Age'])
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

11. The program should do the following?
I Prompt the user to enter the file path of the CSV file containing the student dataR
I Read the CSV file into a Pandas DataFrame?
I Calculate the mean, median, and mode of the test scores using Pandas toolsR
I Display the mean, median, and mode in a table.

Assume the CSV file contains the following columns?
I Student ID: The ID of the studentR
I Test Score: The score of the student's test.
Example usage of the program:

Enter the file path of the CSV file containing the student data: student_data.csv

+-----------+--------+

| Statistic | Value  |

+-----------+--------+

| Mean      | 79.6   |

| Median    | 82     |

| Mode      | 85, 90 |

+-----------+--------+


Assume that the CSV file student_data.csv contains the following data:

Student ID,Test Score

1,85

2,90

3,80

4,75

5,85

6,82

7,78

8,85

9,90

10,85


The program should calculate the mean, median, and mode of the test scores and display the results in a table

In [ ]:
data= {'student_id':[1,2,3,4,5,6,7,8,9,10],
      'Test_score':[85,90,80,75,85,82,78,85,90,85]}

In [ ]:
df= pd.read_csv('student_data.csv')

In [ ]:
df

   Student_ID  Test_score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85